#2. Тізімдердегі, кортеждердегі, жиындардағы және сөздіктердегі әдістерді қарастырып, барлығына ортақ 5 әдісті және ерекшеленетін бірнеше (2-3) әдістерді қолдананатын бағдарлама жаз. 
# использование списка, кортежа, набора и
# словарь
# Списки
l = []
 
# Добавление элемента в список
l.append(5)
l.append(10)
print("Adding 5 and 10 in list", l)
 
# Удаление элементов из списка
l.pop()
print("Popped one element from list", l)
print()
 
# Набор
s = set()
 
# Добавление элемента в набор
s.add(5)
s.add(10)
print("Adding 5 and 10 in set", s)
 
# Удаление элемента из набора
s.remove(5)
print("Removing 5 from set", s)
print()
 
# Кортеж
t = tuple(l)
 
# Кортежи неизменяемы
print("Tuple", t)
print()
 
# Словарь
d = {}
 
# Добавление пары ключ-значение
d[5] = "Five"
d[10] = "Ten"
print("Dictionary", d)
 
# Удаление пары ключ-значение
del d[10]
print("Dictionary", d)
    
    


